questions_quiz_one = [
    {
        "text": "Какова миссия компании TrustMe?",
        "options": [
            "Делать документы красивыми",
            "Делать мир лучше с помощью технологий и инноваций",
            "Увеличить количество клиентов до 10 000",
            "Создать лучшую CRM-систему",
        ],
        "correct": 1,
    },
    {
        "text": "Какова цель компании TrustMe?",
        "options": [
            "Стать лидером в области SaaS-сервисов в Казахстане",
            "Стать единорогом в Казахстане (оценка компании $1 миллиард)",
            "Развивать блокчейн-технологии в Казахстане",
            "Стать единорогом в Казахстане, используя технологии и инновации для улучшения мира",
        ],
        "correct": 3,
    },
    {
        "text": "Какие три принципа лежат в основе TrustMe?",
        "options": [
            "Скорость, Точность, Активность",
            "Клиентоориентированность, Эффективность, Результативность",
            "Креативность, Гибкость, Обучаемость",
            "Ответственность, Честность, Уважение",
        ],
        "correct": 1,
    },
    {
        "text": "Какие ценности лежат в основе корпоративной культуры TrustMe?",
        "options": [
            "Прозрачность, Ответственность, Скорость, Сплоченность, Развитие",
            "Контроль, Соревнование, Прибыль",
            "Независимость, Тишина, Лояльность",
            "Формальность, Исполнительность, Риск",
        ],
        "correct": 0,
    },
    {
        "text": "В каком году компания TrustMe начала свой путь как платформа для отзывов и рекомендаций?",
        "options": ["2018", "2019", "2020", "2021"],
        "correct": 2,
    },
    {
        "text": "Что такое TrustContract?",
        "options": [
            "CRM для управления продажами",
            "Сервис для создания и подписания SmartContract-ов через телефон",
            "Приложение для тайм-трекинга",
            "Чат-бот для клиентов",
        ],
        "correct": 1,
    },
    {
        "text": "Какие технологии обеспечивают безопасность данных?",
        "options": [
            "Блокчейн и криптография",
            "VPN и SSL",
            "Антивирусы",
            "Облачное хранение",
        ],
        "correct": 0,
    },
    {
        "text": "Какие интеграции поддерживает TrustContract?",
        "options": [
            "Только Telegram",
            "Jira, Bitrix24, Enbek.kz, Egov.kz, 1С",
            "Только Google Workspace",
            "Нет интеграций",
        ],
        "correct": 1,
    },
    {
        "text": "В каком году появились первые клиенты в TrustMe?",
        "options": ["2020", "2021", "2022", "2023"],
        "correct": 2,
    },
    {
        "text": "Что такое «Простая электронная подпись (ПЭП)» в контексте законодательства Казахстана, согласно информации от TrustMe?",
        "options": [
            "Подпись, которая признана законной наравне с ЭЦП с 20 июля 2024 года",
            "Подпись, требующая обязательного нотариального заверения для всех сделок",
            "Подпись, используемая исключительно для внутренних документов компании",
            "Временная подпись, действующая только в течение 24 часов",
        ],
        "correct": 0,
    },
    {
        "text": "Что обозначает термин “SaaS”?",
        "options": [
            "Программное обеспечение, которое устанавливается локально",
            "Программное обеспечение, предоставляемое как услуга через интернет",
            "Система автоматизации аналитики",
            "Сервис для подписания документов",
        ],
        "correct": 1,
    },
    {
        "text": "Что означает термин “Agile”?",
        "options": [
            "Методология гибкого управления проектами",
            "Система оплаты труда",
            "Стратегия продаж",
            "Программа для отчетов",
        ],
        "correct": 0,
    },
    {
        "text": "Что такое SCRUM?",
        "options": [
            "Вид agile-презентации",
            "Метод управления проектами с короткими спринтами",
            "CRM-система",
            "Метод продаж",
        ],
        "correct": 1,
    },
    {
        "text": "Спринты — это:",
        "options": [
            "Месячные отчёты о выполненных задачах",
            "Короткие циклы работы (обычно 1–4 недели), по окончании которых команда должна продемонстрировать готовую часть продукта",
            "Системы для управления задачами в рамках проектов",
            "Совещания для обсуждения результатов работы команды",
        ],
        "correct": 1,
    },
    {
        "text": "Какие ежедневные встречи проводятся в рамках Agile?",
        "options": ["Demo", "Stand-up", "Retrospective", "Review"],
        "correct": 1,
    },
    {
        "text": "Что означает термин “Retrospective”?",
        "options": [
            "Планирование задач на неделю",
            "Встреча для обсуждения ошибок и улучшений после спринта",
            "Обучающий тренинг",
            "Встреча с инвесторами",
        ],
        "correct": 1,
    },
    {
        "text": "Что обязаны соблюдать сотрудники TrustMe при работе с данными коллег и клиентов?",
        "options": [
            "Точность в отчетах",
            "Конфиденциальность информации",
            "Скорость выполнения задач",
            "Соблюдение дресс-кода",
        ],
        "correct": 1,
    },
    {
        "text": "Какова цель каждого из следующих отделов?",
        "options": [
            "Коммерческий блок: увеличение продаж и расширение клиентской базы, Customer Care: поддержка и удовлетворенность клиентов, Отдел GR: взаимодействие с государственными органами и защита интересов компании",
            "Коммерческий блок: продвижение продуктов, Customer Care: обучение клиентов, Отдел GR: увеличение продаж через госзаказы",
            "Коммерческий блок: работа с партнерами, Customer Care: создание рекламных кампаний, Отдел GR: работа с клиентами",
            "Коммерческий блок: рост продаж и расширение клиентской базы, Customer Care: обеспечение высокого уровня удовлетворенности клиентов, Отдел GR: установление отношений с государственными органами и защита интересов компании в публичной сфере",
        ],
        "correct": 3,
    },
    {
        "text": "Какова цель каждого из следующих отделов?",
        "options": [
            "Маркетинговый блок: повышение узнаваемости бренда и привлечение новых клиентов, Product Team: создание и поддержка продуктов, Dev Team: разработка и тестирование решений для стабильности",
            "Маркетинговый блок: улучшение качества обслуживания, Product Team: улучшение интерфейса, Dev Team: обеспечение безопасности",
            "Маркетинговый блок: рекламные кампании и продвижение продуктов, Product Team: создание и поддержка продуктов, Dev Team: обеспечение стабильности",
            "Маркетинговый блок: привлечение и удержание клиентов через продвижение продуктов, Product Team: создание и поддержка продуктов, Dev Team: разработка и тестирование решений для стабильности",
        ],
        "correct": 3,
    },
    {
        "text": "Какова цель каждого из следующих отделов?",
        "options": [
            "HR блок: привлечение, развитие и удержание сотрудников, Финансовый отдел: управление финансовой стабильностью и соблюдение законодательства",
            "HR блок: управление зарплатами и бонусами, Финансовый отдел: привлечение инвестиций и увеличение прибыли",
            "HR блок: управление обучением и карьерным ростом сотрудников, Финансовый отдел: соблюдение налоговых требований",
            "HR блок: создание корпоративной культуры и поддержание вовлеченности, Финансовый отдел: эффективное управление ресурсами и финансовая стабильность",
        ],
        "correct": 3,
    },
    {
        "text": "Что такое «опцион для сотрудников» в компании TrustMe?",
        "options": [
            "Ежегодный бонус в размере до 30% от оклада",
            "Компенсация платных курсов для повышения квалификации",
            "Возможность стать совладельцем компании, приобретя её акции в будущем по фиксированной цене",
            "Возможность получить дополнительный оплачиваемый отпуск",
        ],
        "correct": 2,
    },
    {
        "text": "Кто может участвовать в реферальной программе?",
        "options": [
            "Все сотрудники (кроме HR и их руководителей)",
            "Только HR",
            "Только тимлиды",
            "Только стажёры",
        ],
        "correct": 0,
    },
    {
        "text": "Когда рекомендация (реферальная программа) считается успешной?",
        "options": [
            "Когда кандидат принят и прошёл все этапы проверки",
            "Когда кандидат отправил резюме",
            "После первого интервью",
            "После недели стажировки",
        ],
        "correct": 0,
    },
]

questions_quiz_two = [
    {
        "text": "Какой основной проблемой занимается ТрастКонтракт?",
        "options": [
            "Уменьшение объема бумажной волокиты",
            "Обучение пользователей безопасности",
            "Разработка новых CRM-систем",
            "Снижение затрат на почтовую рассылку",
        ],
        "correct": 0,
    },
    {
        "text": "Какие три шага включает процесс работы с ТрастКонтракт?",
        "options": [
            "Создание договора, отправка на подпись, его печать",
            "Создание документа, отправка на подпись, автоматическое исполнение",
            "Разработка шаблона, отправка письма, регистрация в госреестре",
            "Сканирование, отправка на сервер, подписка",
        ],
        "correct": 1,
    },
    {
        "text": "Какую технологию использует ТрастКонтракт для защиты подписанных документов?",
        "options": [
            "Шифрование по ключу",
            "Технология блокчейн",
            "Верификация по паролю",
            "Программное обеспечение для защиты",
        ],
        "correct": 1,
    },
    {
        "text": "Что такое автоподписание в ТрастКонтракт?",
        "options": [
            "Подпись ставится автоматически без участия пользователя",
            "Подпись ставится автоматически только для массовых рассылок",
            "Подпись ставится автоматически после загрузки документа",
            "Подпись ставится только после ручной проверки документа",
        ],
        "correct": 0,
    },
    {
        "text": "Как работает QR-код в ТрастКонтракт?",
        "options": [
            "Клиент сканирует код и сам вводит данные",
            "Код генерирует PDF документ",
            "Код используется для подписания документов",
            "Код используется для автоматического сохранения документов",
        ],
        "correct": 0,
    },
    {
        "text": "Какую систему использует ТрастКонтракт для интеграции с государственными базами данных?",
        "options": [
            "Систему электронной подписи",
            "Государственные базы данных Egov",
            "Интеграция с социальными сетями",
            "Интеграция с банковскими системами",
        ],
        "correct": 1,
    },
    {
        "text": "Какие CRM-системы интегрированы с ТрастКонтракт?",
        "options": [
            "Zoho и Salesforce",
            "Microsoft Dynamics и Oracle CRM",
            "1С и другие популярные CRM-системы",
            "Только собственная CRM система",
        ],
        "correct": 2,
    },
    {
        "text": "Как ТрастКонтракт помогает ускорить процесс подписания договоров?",
        "options": [
            "За счет автоматической отправки документов на подпись",
            "С помощью ускоренной регистрации документов",
            "Используя электронную почту для массовых рассылок",
            "Через централизованные базы данных",
        ],
        "correct": 0,
    },
    {
        "text": "Что делает ТрастКонтракт с документами после их подписания?",
        "options": [
            "Сохраняет их в архиве компании",
            "Отправляет на печать",
            "Автоматически исполняет и сохраняет их",
            "Сохраняет в облачном хранилище",
        ],
        "correct": 2,
    },
    {
        "text": "Какая особенность в безопасности ТрастКонтракт гарантирует отсутствие ошибок и мошенничества?",
        "options": [
            "Встроенная двухфакторная аутентификация",
            "Верификация по Face ID и проверка документов",
            "Использование паролей, выданных клиентами",
            "Подпись только через физические устройства",
        ],
        "correct": 1,
    },
]


questions_quiz_three = [
    {
        "text": "Куда необходимо отправлять данные кандидата по реферальной программе?",
        "options": [
            "На почту hr@trustme.kz",
            "Через Telegram HR",
            "В JIRA",
            "Через форму Bitrix",
        ],
        "correct": 0,
    },
    {
        "text": "Кто не может участвовать в реферальной программе TrustMe?",
        "options": [
            "HR-отдел и рекрутеры",
            "Стажёры",
            "Сотрудники отдела маркетинга",
            "Team Lead-ы",
        ],
        "correct": 0,
    },
    {
        "text": "При каких условиях рекомендация считается успешной?",
        "options": [
            "Кандидат дал согласие на обработку данных и прошёл все этапы отбора",
            "Достаточно отправить имя и телефон кандидата",
            "Если кандидат пришёл на интервью",
            "Если кандидат подписал NDA",
        ],
        "correct": 0,
    },
    {
        "text": "Когда выплачивается вознаграждение за успешную рекомендацию?",
        "options": [
            "50% после подписания договора, 50% после испытательного срока",
            "Сразу после интервью",
            "После 6 месяцев работы кандидата",
            "После окончания года",
        ],
        "correct": 0,
    },
    {
        "text": "Что делает SCRUM-мастер в компании TrustMe?",
        "options": [
            "Помогает команде следовать процессу и устраняет препятствия",
            "Проводит интервью с клиентами",
            "Контролирует финансовые отчёты",
            "Создаёт маркетинговые кампании",
        ],
        "correct": 0,
    },
    {
        "text": "Для чего используется Bitrix в TrustMe?",
        "options": [
            "Для управления продажами и взаимодействием с клиентами",
            "Для контроля времени прихода сотрудников",
            "Для ведения бухгалтерии",
            "Для обучения сотрудников",
        ],
        "correct": 0,
    },
    {
        "text": "Что оценивается при управлении эффективностью сотрудников?",
        "options": [
            "Достижение целей, качество работы, инициативность и ответственность",
            "Возраст и стаж работы",
            "Количество сообщений в чате",
            "Частота обращений к HR",
        ],
        "correct": 0,
    },
    {
        "text": "Что запрещено в рамках политики конфиденциальности TrustMe?",
        "options": [
            "Обсуждать зарплаты и личные данные коллег",
            "Оставлять компьютер включённым",
            "Использовать корпоративный чат",
            "Делиться книгами между сотрудниками",
        ],
        "correct": 0,
    },
    {
        "text": "Что рекомендуется использовать для повышения концентрации на задачах?",
        "options": [
            "Pomodoro Technique — 25 минут работы и 5 минут перерыва",
            "Одновременная работа над несколькими задачами",
            "Работа без перерыва весь день",
            "Отсутствие планирования",
        ],
        "correct": 0,
    },
    {
        "text": "Что является основной целью регулярных ретроспектив?",
        "options": [
            "Обсудить успехи недели и найти способы улучшения работы",
            "Проверить посещаемость сотрудников",
            "Рассчитать бонусы",
            "Организовать корпоративное мероприятие",
        ],
        "correct": 0,
    },
]
